Предполагается, что в рамках данного задания ученики сами будут изучать документацию, как минимум используя функционал `tab` и `shift+tab` от Jupyter

1. Импортируйте библиотеку pandas 
2. Считайте файл `wage.csv` в DataFrame с названием `wage`. Используйте для этого функцию pd.read_csv()

`person_id` - идентификатор человека

`gender` - пол, 0 - женский, 1 - мужской

`wage` - заработная плата в рублях

In [6]:
import pandas as pd
df = pd.read_csv('wage-1.csv')
df

      person_id  gender           wage
0             0       1   46793.603811
1             1       1   33481.575720
2             2       1   44523.699084
3             3       1   15995.576829
4             4       0   10282.631224
...         ...     ...            ...
1001        995       1   66503.737185
1002        996       1    9972.956272
1003        997       0  104504.616392
1004        998       1   98927.903076
1005        999       1  108107.141368

[1006 rows x 3 columns]

3. Поменяйте колонку `gender` так, чтобы были записи `F` (female) и `M` (male) вместо 0 и 1

In [7]:
df['gender'].replace({1: 'M', 0: 'F'}, inplace=True)
df

C:\Users\Qwert\AppData\Local\Temp\ipykernel_19076\1130639996.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['gender'].replace({1: 'M', 0: 'F'}, inplace=True)

      person_id gender           wage
0             0      M   46793.603811
1             1      M   33481.575720
2             2      M   44523.699084
3             3      M   15995.576829
4             4      F   10282.631224
...         ...    ...            ...
1001        995      M   66503.737185
1002        996      M    9972.956272
1003        997      F  104504.616392
1004        998      M   98927.903076
1005        999      M  108107.141368

[1006 rows x 3 columns]

4. Давайте посчитаем среднюю зарплату у мужчин и женщин. Для этого используйте метод `groupby` со следующим синтаксисом:

`dataframe.groupby(Название_колонки_для_группировки)[Перечисление_колонок_для_агрегации].функция_агрегации()`

In [8]:
df.groupby('gender')['wage'].mean()

gender
F    40855.747261
M    46815.944005
Name: wage, dtype: float64

5. Теперь взглянем внимательнее на данные и обнаружим, что некоторые люди попали в выборку несколько раз. 
    1. Найдите таких людей. Подсказка: `value_counts()`
    0. Убедитесь, что записи по ним с одинаковым `wage`. Возможно, тут вам пригодится функция агрегации `nunique()`, отображающая количество разных значений
    0. Избавьтесь от повторяющихся значений. Подсказка: `drop_duplicates()`

In [12]:
#df.value_counts()
#df.nunique()
df.drop_duplicates('person_id', inplace=True)
df.value_counts()

person_id  gender  wage
0          M       46793.603811     1
671        F       10248.867587     1
658        F       19783.977951     1
659        F       10461.600089     1
660        M       65520.795238     1
                                   ..
338        F       24467.660296     1
339        M       19057.252451     1
340        F       69126.349194     1
341        F       25954.347353     1
999        M       108107.141368    1
Name: count, Length: 1000, dtype: int64

6. Теперь посмотрим внимательнее на зарплаты
    1. Охарактеризуйте имеющиеся данные по зарплатам. Подсказка: `describe`
    1. Избавьтесь от бессмысленных значений

In [22]:
df['wage'].describe()
df = df[df['wage'] > 0]
df['wage'].describe()

count       995.000000
mean      44306.969585
std       54302.194392
min         945.648458
25%       14683.306148
50%       27519.361794
75%       52267.313664
max      755320.874132
Name: wage, dtype: float64

7. Давайте теперь посмотрим на зарплату с учетом бонуса. Для этого нам понадобится таблица `bonus.csv`. Считайте ее в переменную `bonus`. Заметьте, что она сохранена немного в другом формате, и вам понадобится уточнить параметр `sep` - разделитель записей. Сравните текущий файл с предыдущим и попробуйте решить проблему

In [24]:
df2 = pd.read_csv('bonus-1.csv', sep=';')
df2

     person_id          bonus
0          905   85059.638382
1          836    7703.346074
2          287    3120.269742
3          548    5347.987142
4          575  137257.490614
..         ...            ...
445        488   28102.252903
446        913   55549.347647
447        616  620397.407705
448        110   14086.067488
449        848   13441.072859

[450 rows x 2 columns]

8. Чтобы посчитать итоговую зарплату, нам нужно по каждому человеку знать и оклад, и премию. Для этого надо будет соединить (сджойнить) таблицы по `person_id`. Используйте для этого функцию `pd.merge`. Помните, что параметр `how` должен быть `'outer'`, чтобы сохранить те записи, что есть только в одной таблице. Результат запишите в новый dataframe `df`

In [34]:
res = df.merge(df2, how='outer', on='person_id')
res

     person_id gender           wage         bonus
0            0      M   46793.603811  3.332934e+04
1            1      M   33481.575720           NaN
2            2      M   44523.699084  3.192912e+06
3            3      M   15995.576829  2.196858e+04
4            4      F   10282.631224           NaN
..         ...    ...            ...           ...
994        995      M   66503.737185  3.452137e+03
995        996      M    9972.956272  3.892790e+05
996        997      F  104504.616392  5.380978e+04
997        998      M   98927.903076           NaN
998        999      M  108107.141368           NaN

[999 rows x 4 columns]

9. Наконец, давайте посчитаем итоговую зарплату
    1. Замените отсутствующие записи в колонке `bonus` нулями
    1. Уберите людей без `wage` - это те "плохие" записи, от которых мы избавлялись на предыдущих шагах
    1. Сделайте новую колонку `total`, которая будет равна 12 окладам и премии
    1. Посчитайте среднюю и медианную итоговую зарплату в разрезе по полу. Подсказка: вместо функции агрегации можно написать `.agg()` и перечислить внутри нужные агрегаты

In [43]:
res = res.fillna(0)
res = res[res['wage'] > 0]
res['total'] = res['wage'] * 12 + res['bonus']
res.groupby('gender')['total'].agg('mean', 'median')

gender
F    570746.139432
M    657142.490282
Name: total, dtype: float64

10. Сохраните `df` в файл, используя метод `to_csv()`. Не записывайте индексы

In [44]:
df.to_csv('pysolved.csv')